Revit 2027 API
DockablePane.GetTitle Method
 Returns the current title (a.k.a. window caption) of the dockable pane.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetTitle()
Public Function GetTitle As String
public:
String^ GetTitle()
member GetTitle : unit -> string
Return Value
String
See Also
Reference
DockablePane Class
Autodesk.Revit.UI Namespace